<?php
/**
 * Ukrainian Language File for News Plugin
 *
 * @package news
 * @version 0.9.5
 * @author Cotonti Translators Team
 * @copyright Copyright (c) Cotonti Team 2011
 * @license BSD
 */

defined('COT_CODE') or die('Wrong URL.');

/**
 * Plugin Config
 */

$L['cfg_category'] = array('Категорії стрічки новин', 'Коди категорій стрічки новин необхідно розділяти комами.<br />Для виведення на головній сторінці головної (перша в списку) категорії новин використовуйте тег {INDEX_NEWS} в файлі index.tpl.<br />Вивід додаткових (наступних за першою) категорій новин здійснюється за допомогою тега <strong>{INDEX_NEWS_КОДКАТЕГОРІЇ}</strong> В файлі index.tpl. За допомогою шаблону <strong>news.кодкатегорії.tpl</strong> можна налаштувати відображення стрічки новин для кожної з категорій.');
$L['cfg_maxpages'] = array('Кількість відображуваних сторінок');
$L['cfg_syncpagination'] = array('Синхронне переключення сторінок');

$L['info_desc'] = 'Підхоплює сторінки з категорії і відображає новіші з них на головній сторінці';

$L['Maincat']='Основна категорія новин';
$L['Addcat']='Додаткові категорії новин';
$L['NewsCount']='Кількість новин';
$L['Template']='Шаблон';
$L['Template_help']='Якщо відсутній шаблон додаткових новин у папці {ВАШ_СКІН}/plugins, то буде використаний шаблон основний новинний категорії';
$L['Newscat_exists']='Дана категорія вже вибрана. Виберіть іншу категорію';
$L['Unsetadd']= 'Не використовувати додаткову категорію, якщо вона відповідає основній категорії.';
$L['Newsautocut']='Ограничение символов';
$L['Newsautocutdesc']='На сторінці новин будуть виведені тільки перші N символів, зазначені в налаштуваннях, з урахуванням абзаців. За замовчуванням обрізка новин не проводиться.';

$L['news_help'] = '';

?>