<?php
/**
 * Ukrainian Language File for News Plugin
 *
 * @package News
 * @copyright (c) Cotonti Translators Team
 * @license https://github.com/Cotonti/Cotonti/blob/master/License.txt
 */

defined('COT_CODE') or die('Wrong URL.');

/**
 * Plugin Info
 */

$L['info_desc'] = 'Підхоплює сторінки з категорії і відображає новіші з них на головній сторінці';

/**
 * Plugin Config
 */

$L['cfg_category'] = 'Категорії стрічки новин';
$L['cfg_category_hint'] = 'Коди категорій стрічки новин необхідно розділяти комами.<br />Для виведення на головній сторінці головної (перша у списку) категорії новин використовуйте тег {INDEX_NEWS} у файлі index.tpl.<br />Відображення додаткових (наступних за першою) категорій новин здійснюється за допомогою тега <strong>{INDEX_NEWS_КОДКАТЕГОРІІ}</strong> у файлі index.tpl. За допомогою шаблону <strong>news.кодкатегоріі.tpl</strong> можна налаштувати відображення стрічки новин для кожної з категорій.';
$L['cfg_maxpages'] = 'Кількість відображуваних сторінок';
$L['cfg_syncpagination'] = 'Синхронне перемикання сторінок';
$L['cfg_cache_ttl'] = 'Час життя кешу в секундах';
$L['cfg_cache_ttl_hint'] = '0 - кеш відключений';

$L['Maincat'] = 'Основна категорія новин';
$L['Addcat'] = 'Додаткові категорії новин';
$L['NewsCount'] = 'Кількість новин';
$L['Template'] = 'Шаблон';
$L['Template_help'] = 'Якщо відсутній шаблон додаткових новин у папці {ВАША_ТЕМА}/plugins, то буде використаний шаблон основний новинний категорії';
$L['Newscat_exists'] = 'Дана категорія вже вибрана. Виберіть іншу категорію';
$L['Unsetadd'] = 'Не використовувати додаткову категорію, якщо вона відповідає основній категорії.';
$L['Newsautocut'] = 'Ограничение символов';
$L['Newsautocutdesc'] = 'На сторінці новин будуть виведені тільки перші N символів, зазначені в налаштуваннях, з урахуванням абзаців. За замовчуванням обрізка новин не проводиться.';

$L['news_help'] = '';
